// // // // // // // let n = 10;

// // // // // // // let current = 0;
// // // // // // // let prev = 1;
// // // // // // // let prevPrev  =0;

// // // // // // // while (n--> 0) {
// // // // // // //     prevPrev = prev;
// // // // // // //     prev = current;
// // // // // // //     current += prevPrev;
// // // // // // //     console.log(current);
// // // // // // // }

// // // // // // // let man = function(a,b) {
// // // // // // //     return (a + b);
// // // // // // // }


// // // // // // 1)
// // // // // // Используя конструкцию
// // // // // // if..else
// // // // // // , напишите код, который получает число через
// // // // // // prompt
// // // // // // , а затем выводит в
// // // // // // alert
// // // // // // :
// // // // // // 1
// // // // // // , если значение больше нуля,
// // // // // // -1
// // // // // // , если значение меньше нуля,
// // // // // // 0
// // // // // // , если значение равно нулю.
// // // // // // Предполагается, что пользователь вводит только числа.


// // // // 3)
// // // // let message ;
// // // // if ( login=='Сотрудник'){
// // // // message='Привет';}else
// // // // if(login=='Директор')
// // // // {message= 'Здравствуйте';}else
// // // // if(login==''){message='Нет логина';}
// // // // else{message='';}


// // 1)
// // // let num1 =0;
// // // if(num1>0){
// // //     console.log(1)
// // // } else if(num1 < 1){
// // //     console.log(-1)
// // // }else if (num1 = 0){
// // //     console.log(0)
// // // };

// // // // // 2)
// // // // // let result ;
// // // // // if(a+b<4){result='Мало';}
// // // // // else
// // // // // {result='Много';}

// 2)
let result = 
