// // // // // // // // // // // // // // // // // // let n = 10;

// // // // // // // // // // // // // // // // // // let current = 0;
// // // // // // // // // // // // // // // // // // let prev = 1;
// // // // // // // // // // // // // // // // // // let prevPrev  =0;

// // // // // // // // // // // // // // // // // // while (n--> 0) {
// // // // // // // // // // // // // // // // // //     prevPrev = prev;
// // // // // // // // // // // // // // // // // //     prev = current;
// // // // // // // // // // // // // // // // // //     current += prevPrev;
// // // // // // // // // // // // // // // // // //     console.log(current);
// // // // // // // // // // // // // // // // // // }

// // // // // // // // // // // // // // // // // // let man = function(a,b) {
// // // // // // // // // // // // // // // // // //     return (a + b);
// // // // // // // // // // // // // // // // // // }


// // // // // // // // // // // // // // // // // 1)
// // // // // // // // // // // // // // // // // Используя конструкцию
// // // // // // // // // // // // // // // // // if..else
// // // // // // // // // // // // // // // // // , напишите код, который получает число через
// // // // // // // // // // // // // // // // // prompt
// // // // // // // // // // // // // // // // // , а затем выводит в
// // // // // // // // // // // // // // // // // alert
// // // // // // // // // // // // // // // // // :
// // // // // // // // // // // // // // // // // 1
// // // // // // // // // // // // // // // // // , если значение больше нуля,
// // // // // // // // // // // // // // // // // -1
// // // // // // // // // // // // // // // // // , если значение меньше нуля,
// // // // // // // // // // // // // // // // // 0
// // // // // // // // // // // // // // // // // , если значение равно нулю.
// // // // // // // // // // // // // // // // // Предполагается, что пользователь вводит только числа.



// // // // // // // // // // // // // 1)
// // // // // // // // // // // // // // let num1 =0;
// // // // // // // // // // // // // // if(num1>0){
// // // // // // // // // // // // // //     console.log(1)
// // // // // // // // // // // // // // } else if(num1 < 1){
// // // // // // // // // // // // // //     console.log(-1)
// // // // // // // // // // // // // // }else if (num1 = 0){
// // // // // // // // // // // // // //     console.log(0)
// // // // // // // // // // // // // // };

// // // // // // // // // // // // // // // // 2)
// // // // // // // // // // // // // // // // let result ;
// // // // // // // // // // // // // // // // if(a+b<4){result='Мало';}
// // // // // // // // // // // // // // // // else
// // // // // // // // // // // // // // // // {result='Много';}

// // // // // // // // // // // // 2)
// // // // // // // // // // // let result = (a+b<4) ? MALO : mnogo;

// // // // // // // // // // // // // // // 3)
// // // // // // // // // // // // // // // let message ;
// // // // // // // // // // // // // // // if ( login=='Сотрудник'){
// // // // // // // // // // // // // // // message='Привет';}else
// // // // // // // // // // // // // // // if(login=='Директор')
// // // // // // // // // // // // // // // {message= 'Здравствуйте';}else
// // // // // // // // // // // // // // // if(login==''){message='Нет логина';}
// // // // // // // // // // // // // // // else{message='';}

// // // // // // // // // // let message = (login == 'Member' ) ? Hello :(login == 'Ceo') ? Cesch:(login = '')? Net logina : '';
// // // // // // // // // let number = 1;

// // // // // // // // // if (number > 0) {
// // // // // // // // //     console.log(`${number} is positive.`);
// // // // // // // // // } else if (number < 0) {
// // // // // // // // //     console.log(`${number} is negative.`);
// // // // // // // // // } else {
// // // // // // // // //     console.log(`${number} is zero.`);
// // // // // // // // // }

// // // // // // // // 4)Создайте программу, которая проверяет, является ли введенное число положительным или отрицательным, и выводит соответствующее сообщение.
// // // // // // // let num2 = 0;
// // // // // // // if(num2 >0){
// // // // // // //     console.log('Positive')
// // // // // // // }else{
// // // // // // //     console.log('otricatelnoe')
// // // // // // // }

// // // // // // let Vage = prompt('Введите возраст:');
// // // // // // let voice = (parseInt(Vage) >= 18) ? 'can' : 'impossible';
// // // // // // console.log(`Голосование ${voice}`);

// // // // // 5)Напишите программу, которая принимает на вход число месяца и выводит название времени года (зима, весна, лето, осень).
// // // // let num =6;
// // // // let Nmonths = 
// // // // (num===0)?'january'&&'Winter':
// // // // (num===1)?'february'&&'Winter':
// // // // (num===2) ?'march'&&'Spring':
// // // // (num===3)?'april'&&'Spring':
// // // // (num===4) ?'may'&&'Spring':
// // // // (num===5) ?'june'&&'Summer':
// // // // (num===6) ?'july'&&'Summer':
// // // // (num===7) ?'august'&&'Summer':
// // // // (num===8) ?'september'&&'Autumn':
// // // // (num===9) ?'october'&&'Autumn':
// // // // (num===10) ?'november'&&'Autumn':
// // // // (num===11) ?'december'&&'Winter':''
// // // // console.log(Nmonths);


// // // 6)Создайте программу, которая принимает на вход три числа и выводит максимальное из них.
// // let num1=222;
// // let num2=5000;
// // let num3=121121;
// // let MaxNum = (num1>num2&&num3)?num1:(num2>num1&&num3)?num2:(num3>num1&&num2)?num3:'';
// // console.log(MaxNum);
// let num1 = 2;
// let num2 = 10;
// let num3 = 11;

// let MaxNum = (num1 > num2 && num1 > num3) ? num1 :
//              (num2 > num1 && num2 > num3) ? num2 :
//              (num3 > num1 && num3 > num2) ? num3 : '';

// console.log(MaxNum);
